package ru.mephi.java.part5.task09;

import java.util.Scanner;

public class Task09 {
    Scanner sc = new Scanner(System.in);
    // Когда начинающему программировать вылетает исключение при чтении, то это гораздо
    // менее понятно для него, т.к. ему будет сложнее понять причину этих исключений.
    // Гораздо более логичным выглядит сразу приучать программиста к продумыванию ситуаций,
    // на которые он может повлиять, чтобы программист а) знал, что таковые вообще могут быть
    // б) задумался, а когда они могут быть
}
